[
  {
    "id": "1",
    "name": "South West Exposures",
    "description": "Medical isotope shield catalouge and inquiry system. Custom admin content management system for adding, updating, and deleting products.",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "PostgreSQL"],
    "overview": [
      "South West Exposures is a specialized engineering and technology firm focused on creating innovative shielding solutions for sectors that work with advanced drug therapies and radiological materials.",
      "They came to me with an existing WordPress website that no longer reflected the quality or sophistication of their work. The site suffered from poor SEO performance, inconsistent structure, and an outdated user interface that made it difficult for visitors to quickly understand their products and expertise. They wanted a completely new look and feel for the UI, along with a stronger foundation for search visibility. Just as importantly, they needed the ability to easily add and manage their own content, rather than relying on static, hard-coded pages, so their site could grow and evolve alongside the business."
    ],
    "keyFeatures": [
      "Custom content management system",
      "Product catalog with filters and sorting",
      "Contact form powered by Resend",
      "Responsive design for mobile and desktop",
      "SEO optimized with dynamic meta tags",
      "Deployed on Vercel with automated CI/CD"
    ],
    "challenges": [
      "A major early challenge was sourcing the right creative talent to support the new design direction. The project required both a UI/UX designer to help shape the user experience and a 3D renderer to create high quality product imagery that accurately reflected SW Exposures’ offerings.",
      "I collaborated closely with two specialists who brought deep expertise to the project. UI and UX design was led by <Link href=\"https://www.linkedin.com/in/adamrwood\">Adam Wood<Link/>, while 3D product rendering was handled by <Link href=\"https://www.linkedin.com/in/sony-chen-48433b135\">Sony Chen<Link/>. Their combined work made it possible to clearly present complex, highly technical products through a clean and consistent visual system.",
      "Another key challenge was choosing a technology stack that could support long term growth while significantly improving SEO performance. The previous site struggled with search visibility and limited flexibility for modern optimization techniques.",
      "Next.js was selected as the foundation for the rebuild due to its performance and SEO advantages. PostgreSQL was used as the primary database to support structured, scalable content management and future expansion. Each product page was implemented with dynamic meta tags to improve search relevance, and an automated sitemap was generated and submitted to Google Search Console. This combination created a fast, SEO focused platform that allows for easy content updates and long term maintainability."
    ],
    "outcomes": [
      "Following launch, the new site delivered measurable improvements in performance, visibility, and engagement. Search visibility increased significantly, with indexed pages growing by over 60 percent and several core product pages beginning to rank within the top 10 to 20 results for relevant industry search terms. Dynamic metadata and a properly structured sitemap helped accelerate indexing through Google Search Console.",
      "Customer engagement also improved. Overall site traffic increased by approximately 40 percent, while average time on site increased by 30 percent, indicating that users were more effectively finding and exploring relevant content. Clearer navigation and improved product presentation reduced friction for visitors and made it easier to understand SW Exposures’ offerings.",
      "Operationally, the new platform reduced content update time by an estimated 98 percent, allowing the team to add new products and make changes without developer involvement. The scalable Next.js and PostgreSQL architecture now supports ongoing SEO optimization, future product expansion, and long term growth without the limitations of the previous system."
    ],
    "liveUrl": "https://www.swexposures.com",
    "repoUrl": "https://github.com/connor-kfitz/south-west-exposures",
    "images": [
      "/images/projects/south-west-exposures/pip.png",
      "/images/projects/south-west-exposures/plp.png",
      "/images/projects/south-west-exposures/admin-products.png"
    ]
  },
  {
    "id": "2",
    "name": "Fitzsystems",
    "description": "Software development business website. Designed to provide information on services, showecase projects, and setup a line of communication for potential clients.",
    "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "V0"],
    "overview": [
      "Fitzsystems is my software development business where I design and build software solutions. I have plans to launch other SAAS products under the Fitzsystems brand, so I created a strong foundation for future growth and expansion."
    ],
    "keyFeatures": [
      "Modern Design inspired by ShadCN",
      "Hero section with custom animation",
      "Meeting scheduler integrated with Calendly",
      "Responsive design for mobile and desktop"
    ],
    "challenges": [
      "The main challenge for this project was creating a clean, modern design that effectively communicated my services and expertise without overcomplicating the development process.",
      "To address this challenge, I leverged V0 to create a ShadCN inspiried design. I was able to iterate over versions and tweak the design to my standards and needs.",
      "Another major challenge was the hero section background animation. I was unable to find a suitable design, even with the use of V0.",
      "I came up with the idea of having my companies logo falling from the top of the page. After tweaking with the colors, sizes, and animation, I was able to create a unique and eye catching animation that fit the design of the site and my brand."
    ],
    "liveUrl": "https://fitzsystems.ca",
    "repoUrl": "https://github.com/connor-kfitz/fitzsystems",
    "images": [
      "/images/projects/fitzsystems/home.png",
      "/images/projects/fitzsystems/services.png",
      "/images/projects/fitzsystems/contact.png"
    ]
  }
]
